Modules/Chat/Livewire/MessageTemplate/UpdateOrCreate.php

    public function render()
    {
        $tempMessages = MessageTemplate::query()
            ->when(isset($this->search['id']), function ($q) {
                return $q->where('id', $this->search['id']);
            })->when(isset($this->search['title']), function ($q) {
                return $q->where('title', 'LIKE', "%{$this->search['title']}%");
            })->when(isset($this->search['active']), function ($q) {
                return $q->where('active', $this->search['active']);
            })
            ->paginate(50);
---
select * from `shw_message_templates` limit 50 offset 0
select count(*) as aggregate from `shw_message_templates`