Modules/Admin/Routes/admin.php

select * from `shw_users` where `shw_users`.`id` = 1 limit 1
---
//});
*/

Route::get('/admin', function (NewAppController $controller) {
    if (auth()->user()?->can('ADMIN_ACCESS')) {
        return redirect()->route('admin.dashboard');
    }

    return app()->call($controller)->withHeaders([
        'Cache-Control' => 'no-store, private',
        'Pragma' => 'no-cache',
        'X-Frame-Options' => 'DENY',
        'X-Content-Type-Options' => 'nosniff',
        'Referrer-Policy' => 'no-referrer',
    ]);
})->name('admin.login');