Modules/AppointmentUser/Livewire/Admin/AppointmentUserList.php

select * from `shw_roles`
select * from `shw_services` where `shw_services`.`deleted_at` is null
---
    public function mount()
    {
        $this->fetchData['appointmentSetter'] = Role::all();
        $this->fetchData['Services'] = Service::all();