Modules/AppointmentUser/Livewire/Admin/AppointmentUserCreateOrUpdate.php

select exists(select * from `shw_appointment_settings` where `user_id` = 4 and `shw_appointment_settings`.`deleted_at` is null) as `exists`
select * from `shw_users` where `shw_users`.`id` = 4 limit 1
---
    public function docSelected(User $user)
    {
        $this->fetchData = [];
        $this->form['modalSelectedData']['serviec'] = null;
        $this->form['modalSelectedData']['place']   = null;
        $this->form['modalSelectedData']['doctor'] = $user->id;
        if (AppointmentSetting::where('user_id', $user->id)->exists()) {
            $this->fetchData['placeList'] = $user->places;
            //check if there is more than 1 place exist
            if (count($this->fetchData['placeList']) == 1) {
                $this->form['modalSelectedData']['place'] = $this->fetchData['placeList']->first()->id;
                if (
                    !empty($this->form['modalSelectedData']['doctor']) &&
                    !empty($this->form['modalSelectedData']['place'])
                ) {
                    $doctor = User::find($this->form['modalSelectedData']['doctor']);

select exists(select * from `shw_services` where `shw_services`.`deleted_at` is null) as `exists`
---
    public function mount()
    {

        if (!Service::exists()) {

select * from `shw_services` where `active` = 1 and `shw_services`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `shw_services` where `active` = 1 and `shw_services`.`deleted_at` is null
---
    public function render()
    {
        $permitionCheck = auth()->user();
        $permitionCondition = !$permitionCheck->isAdmin() && $permitionCheck->hasRole('پزشک') ;
        $docQuery = User::doctors_query()->when( $permitionCondition,function($q){
                return $q->where('id',auth()->user()->id);
        });
        if (isset($docQuery)) {
            $docQuery =  $docQuery->where(function ($query) {
                $query->whereDoesntHave('metas', function ($q) {
                    $q->where('meta_key', UserMetaEnum::BAN_USER)
                        ->where('meta_value', true);
                });
            })->when(isset($this->search['doctors']) && !empty($this->search['doctors']), function ($query) {
                return $query->where(function ($q) {
                    $q->whereHas('metas', function ($q) {
                        $q->where([
                            ['meta_key', UserMetaEnum::FIRST_NAME],
                            ['meta_value', 'LIKE', "%{$this->search['doctors']}%"],
                        ]);
                    })->orWhereHas('metas', function ($q) {
                        $q->where([
                            ['meta_key', UserMetaEnum::LAST_NAME],
                            ['meta_value', 'LIKE', "%{$this->search['doctors']}%"],
                        ]);
                    });
                });
            })->orderByDesc('id')->paginate(20);
        }
        $Services = Service::when( $permitionCondition,function($q){
            return $q->whereHas('user',function($qq){
                 $qq->where('users.id',auth()->user()->id);
            });
        })->where('active', ActiveEnum::ACTIVE)
            ->when(isset($this->search['searchService']) && !empty($this->search['searchService']), function ($query) {
                return $query->where('title', 'LIKE', "%{$this->search['searchService']}%");
            })->orderByDesc('id')->paginate(20);