Modules/Setting/Entities/Setting.php

select `setting_value` from `shw_settings` where `setting_key` = 3 limit 1
---
    public static function getOriginalVal(int $key)
    {
        $settingMetaKey = SettingKeyEnum::tryFrom($key);
        if ($settingMetaKey !== null) {
            return Setting::whereSettingKey($settingMetaKey)->value('setting_value');