Modules/Admin/Livewire/Dashboard.php

select * from `shw_appointment_users` where date(`date_visit`) = '2025-03-04' and `status` = 1 and `shw_appointment_users`.`deleted_at` is null
select count(*) as aggregate from `shw_appointment_users` where `status` = 1 and `date_visit` between '2024-11-04 21:37:58' and '2024-12-04 21:37:58' and `shw_appointment_users`.`deleted_at` is null
select count(*) as aggregate from `shw_appointment_users` where `status` = 3 and `date_visit` between '2025-02-02 21:37:58' and '2025-03-04 21:37:58' and `shw_appointment_users`.`deleted_at` is null
select count(*) as aggregate from `shw_appointment_users` where `status` = 3 and `date_visit` between '2025-01-03 21:37:58' and '2025-02-02 21:37:58' and `shw_appointment_users`.`deleted_at` is null
select count(*) as aggregate from `shw_appointment_users` where `status` = 3 and `date_visit` between '2024-12-04 21:37:58' and '2025-01-03 21:37:58' and `shw_appointment_users`.`deleted_at` is null
select count(*) as aggregate from `shw_appointment_users` where `status` = 3 and `date_visit` between '2024-11-04 21:37:58' and '2024-12-04 21:37:58' and `shw_appointment_users`.`deleted_at` is null
select count(*) as aggregate from `shw_appointment_users` where date(`date_visit`) = '2025-03-04' and `shw_appointment_users`.`deleted_at` is null
---
    public function mount()
    {
        //scope functions can be found  in the models
        // dd(auth()->user());
        $this->fetchData['today_appointment']    = AppointmentUser::today()->successful()->get()?->count();
        $this->fetchData['pendding_appointment'] = AppointmentUser::waitpayment()->get()?->count();
        $this->fetchData['today_canceld_appointment'] = AppointmentUser::disabled()->today()->get()?->count();
        $this->fetchData['chart']['month'] = [verta()->format('F'), verta()->submonths(1)->format('F'), verta()->submonths(2)->format('F'), verta()->submonths(3)->format('F')];

        $cacheKeySuccessful = 'appointment_successful_counts';
        $cacheKeyCanceled = 'appointment_canceled_counts';
        $this->fetchData['chart']['data']['successful'] = Cache::remember($cacheKeySuccessful, now()->addDay(), function () {
            return [
                AppointmentUser::where('status', AppointmentUserStatusEnum::STATUS_SUCCESSFUL)->whereBetween('date_visit', [verta()->submonths(1)->toCarbon(), verta()->toCarbon()])->count(),
                AppointmentUser::where('status', AppointmentUserStatusEnum::STATUS_SUCCESSFUL)->whereBetween('date_visit', [verta()->submonths(2)->toCarbon(), verta()->submonths(1)->toCarbon()])->count(),
                AppointmentUser::where('status', AppointmentUserStatusEnum::STATUS_SUCCESSFUL)->whereBetween('date_visit', [verta()->submonths(3)->toCarbon(), verta()->submonths(2)->toCarbon()])->count(),
                AppointmentUser::where('status', AppointmentUserStatusEnum::STATUS_SUCCESSFUL)->whereBetween('date_visit', [verta()->submonths(4)->toCarbon(), verta()->submonths(3)->toCarbon()])->count(),
            ];
        });

        $this->fetchData['chart']['data']['canceld'] = Cache::remember($cacheKeyCanceled, now()->addDay(), function () {
            return [
                AppointmentUser::where('status', AppointmentUserStatusEnum::STATUS_CANCEL)->whereBetween('date_visit', [verta()->submonths(1)->toCarbon(), verta()->toCarbon()])->count(),
                AppointmentUser::where('status', AppointmentUserStatusEnum::STATUS_CANCEL)->whereBetween('date_visit', [verta()->submonths(2)->toCarbon(), verta()->submonths(1)->toCarbon()])->count(),
                AppointmentUser::where('status', AppointmentUserStatusEnum::STATUS_CANCEL)->whereBetween('date_visit', [verta()->submonths(3)->toCarbon(), verta()->submonths(2)->toCarbon()])->count(),
                AppointmentUser::where('status', AppointmentUserStatusEnum::STATUS_CANCEL)->whereBetween('date_visit', [verta()->submonths(4)->toCarbon(), verta()->submonths(3)->toCarbon()])->count(),
            ];
        });