Modules/AppointmentUser/app/Models/AppointmentOnlineMessage.php

    public static function badgeCount()
    {
        $logedInUser = auth()->user();
        if (! $logedInUser->isAdmin() && $logedInUser->can('appointment_user.own')) {
            $appointments = AppointmentOnline::whereHas('appointmentUser', function ($qq) {
                return $qq->where('doctor_id', auth()->user()->id)->orWhere('agent_id', auth()->user()->id);
            })->whereIn('status', [
                AppointmentOnlineStatusEnum::REPLY_BY_USER
            ])->count();
        } else {
            $appointments = AppointmentOnline::whereIn('status', [
                AppointmentOnlineStatusEnum::REPLY_BY_USER
            ])->count();
---
select count(*) as aggregate from `shw_appointment_online` where `status` in (4) and `shw_appointment_online`.`deleted_at` is null

    public function unReadedMessageCount()
    {
        return $this->where('appointment_online_id', $this->appointment_online_id)->where('type', AppointmentOnlineMessageTypeEnum::QUESTION)
            ->where('seen', AppointmentOnlineMessageSeenEnum::UNSEEN)
            ->whereNull('answer_by')->count();
---
select count(*) as aggregate from `shw_appointment_online_messages` where `appointment_online_id` = 36388 and `type` = 1 and `seen` = 1 and `answer_by` is null and `shw_appointment_online_messages`.`deleted_at` is null

    public function findAwnswerer(): string
    {
        $answer_by =  $this->online?->messages?->reverse()->firstWhere('answer_by', '!=', null);
---
select * from `shw_appointment_online_messages` where `shw_appointment_online_messages`.`appointment_online_id` = 36388 and `shw_appointment_online_messages`.`appointment_online_id` is not null and `shw_appointment_online_messages`.`deleted_at` is null

    public static function totalUnreaedMessage(): int
    {
        $logedInUser = auth()->user();
        if (! $logedInUser->isAdmin() && $logedInUser->can('appointment_user.own')) {
            $appointments = AppointmentOnline::whereHas('appointmentUser', function ($qq) {
                return $qq->where('doctor_id', auth()->user()->id)->orWhere('agent_id', auth()->user()->id);
            })->whereIn('status', [
                AppointmentOnlineStatusEnum::REPLY_BY_USER
            ])->count();
        } else {
            $appointments = AppointmentOnline::whereIn('status', [
                AppointmentOnlineStatusEnum::REPLY_BY_USER
            ])->count();
---
select * from `shw_appointment_users` where `shw_appointment_users`.`id` = 45177 and `shw_appointment_users`.`deleted_at` is null limit 1
select * from `shw_users` where `shw_users`.`id` = 10 limit 1
select count(*) as aggregate from `shw_appointment_online` where `status` in (4) and `shw_appointment_online`.`deleted_at` is null