Modules/AppointmentUser/app/Models/AppointmentUser.php

    public function confirm_or_reject_by(): string
    {
        $registered_by_user_id =  $this->online()->first()?->details;
        if ($this->hasAgent()) {
            return 'تعیین وضعیت: ' . User::find($registered_by_user_id[AppointmentOnline::COFRIM_OR_REJECT_STATUS][AppointmentOnline::BY])->fullName;
---
select * from `shw_appointment_online` where `shw_appointment_online`.`appointment_user_id` = 45193 and `shw_appointment_online`.`appointment_user_id` is not null and `shw_appointment_online`.`deleted_at` is null limit 1