Modules/Discount/Livewire/UpdateOrCreate.php

select * from `shw_services` where `shw_services`.`deleted_at` is null
---
    public function mount()
    {
        $this->fetchData['services'] = Service::all();