Modules/AppointmentUser/Service/AppointmentUserService.php

    public function listAppointments(AppointmentSetting $appointmentSetting, array $details = [])
    {
        // Get the date range for which you want to fetch appointments and available slots
        $specialDaySelected = false;
        // if (isset($details['specialDay'])) {
            if (array_key_exists('specialDay', $details)) {
                $specialDaySelected = true;
                $startDate = Carbon::parse($details['specialDay'])->subDays(20);
                $endDate = $startDate->copy()->addDays($details['specialDay_endDate'] ?? 60); // Adjust the number of days as needed
            } elseif (array_key_exists('specialDays', $details)) {
                $startDate = Carbon::parse($details['specialDays'])->subDays(20);
                $endDate = $startDate->copy()->addDays($appointmentSetting->max_day_active ?? 90); // Adjust the number of days as needed
            } elseif (array_key_exists('completeDays', $details)) {
                $startDate = Carbon::parse($details['specialDay']);
                $endDate = $startDate->copy()->addDays($details['numberDays']);
            }
        // }

        if (!$specialDaySelected && !isset($startDate)) {
            $startDate = Carbon::today()->subDays(20);
            $endDate = Carbon::today()->addDays($appointmentSetting->max_day_active ?? 90); // Adjust the number of days as needed
        }

        // get holidays
        $holidays = Event::whereBetween('date', [$startDate, $endDate])->where('is_holiday', '1')->get();

        // Fetch appointments for the week
        $doctorId = $appointmentSetting->user->id;
        $appointments = AppointmentUser::where('doctor_id', $doctorId)
            ->whereBetween('date_visit', [$startDate, $endDate])
            ->orderBy('start_time')
            ->get();
---
select * from `shw_events` where `date` between '2025-02-12 00:00:00' and '2025-06-02 00:00:00' and `is_holiday` = '1'
select * from `shw_appointment_users` where `doctor_id` = 40481 and `kind` = 1 and `date_visit` between '2025-02-12 00:00:00' and '2025-06-02 00:00:00' and `shw_appointment_users`.`deleted_at` is null order by `start_time` asc

        // Has set a limit on the number that can be received for 1 day
        $maxAppointmentEachDay = (isset($appointmentSetting->detail[AppointmentSetting::MAX_AVAILABLE_APPOINTMENT_EACH_DAY]) && (int) $appointmentSetting->detail[AppointmentSetting::MAX_AVAILABLE_APPOINTMENT_EACH_DAY] > 0) ? $appointmentSetting->detail[AppointmentSetting::MAX_AVAILABLE_APPOINTMENT_EACH_DAY] : null;

        $appointments = $appointments->sortByDesc(function ($appointment) {
            // If there's no appointment with the same start_time, it should have the highest priority
            $maxEndTime = AppointmentUser::where('start_time', $appointment->start_time)
                ->where('id', '<>', $appointment->id) // Exclude the current appointment
                ->max('end_time');

            // Compare the current appointment's end_time with the maximum end_time
            return $appointment->end_time > $maxEndTime;
        });
---
select * from `shw_users` where `shw_users`.`id` = 40481 limit 1
select max(`end_time`) as aggregate from `shw_appointment_users` where `start_time` = '08:00:00' and `id` <> 36887 and `shw_appointment_users`.`deleted_at` is null