Modules/User/Entities/User.php

    public function isAdmin()
    {
        return $this->roles()->where('id', 1)->count() > 0;
---
select * from `shw_roles` where `shw_roles`.`id` = 3 limit 1

    public function isMama()
    {
        return $this->roles()->where('id', 6)->count() > 0;
---
select * from `shw_roles` where `shw_roles`.`id` = 4 limit 1

    public static function doctors()
    {
        return Role::find(3)?->users;
---
select * from `shw_roles` where `shw_roles`.`id` = 6 limit 1

    public static function operators()
    {
        return Role::find(4)?->users;
---
select * from `shw_roles` where `shw_roles`.`id` = 6 limit 1

    public static function doctors_query()
    {
        return Role::find(3)?->users();
---
select * from `shw_roles` where `shw_roles`.`id` = 3 limit 1

    public static function operators_query()
    {
        return Role::find(4)?->users();
---
select * from `shw_roles` where `shw_roles`.`id` = 4 limit 1

    public function activeServices(): collection
    {
        return $this->services()->where('active', ActiveEnum::ACTIVE)->get();
---
select `shw_services`.*, `shw_service_user`.`user_id` as `pivot_user_id`, `shw_service_user`.`service_id` as `pivot_service_id` from `shw_services` inner join `shw_service_user` on `shw_services`.`id` = `shw_service_user`.`service_id` where `shw_service_user`.`user_id` = 4 and `active` = 1 and `shw_services`.`deleted_at` is null