Modules/AppointmentUser/Livewire/Admin/AddAppointment/ListOfAvailableDay.php

    public function mount()
    {
        $serviceId =  request()->route('sectionId');
        $doctorId  =  request()->route('doctorId');
        $placeId   =  request()->route('placeId');

        $this->fethData['service'] = Service::find($serviceId);
        $this->fethData['doctor']  = User::find($doctorId);
        $this->fethData['place']  = Place::find($placeId);
---
select * from `shw_services` where `shw_services`.`id` = '11' and `shw_services`.`deleted_at` is null limit 1
select * from `shw_users` where `shw_users`.`id` = '40481' limit 1
select * from `shw_places` where `shw_places`.`id` = '1' and `shw_places`.`deleted_at` is null limit 1