Modules/AppointmentUser/Livewire/Admin/AddAppointment/SpecificDayAvailableAppointment.php

select * from `shw_appointment_settings` where `shw_appointment_settings`.`id` = '11' and `shw_appointment_settings`.`deleted_at` is null limit 1
select * from `shw_services` where `shw_services`.`id` = '11' and `shw_services`.`deleted_at` is null limit 1
---
    public function mount()
    {
        $app = AppointmentSetting::find(request()->route('appId'));
        $this->fetchData['service'] = Service::find(request()->route('serviceId'));