Modules/Chat/app/Models/Chat.php

select count(*) as aggregate from `shw_chats` where `status` in (0, 10)
---
    public static function badgeCount()
    {
        return self::whereIn('status',[ChatStatusEnum::JUST_CREATED,ChatStatusEnum::USER_SEND_QUESTION])->count();