Modules/Chat/app/Models/MessageTemplate.php

select max(`priority`) as aggregate from `shw_message_templates`
---
    public static function maxPriority()
    {
        return (self::max('priority') ?? 0) + 1;

select * from `shw_users` where `shw_users`.`id` = '2' limit 1
---
    public function doctorsLimnits()
    {
        if (! isset($this->detail['doc'])) {
            return 'تمام پزشکان';
        }
        if (isset($this->detail['doc']) && in_array('null', $this->detail['doc'])) {
            return 'تمام پزشکان';
        }
        $doctors_name = [];
        foreach ($this->detail['doc'] as $doctorId) {
            $doctors_name[] = User::find($doctorId)->fullName;